const ifData = [
    {
        id: 'mimagu',
        titleRu: 'Путаница',
        fullTitleRu: 'Запутанная жизнь в альтернативном мире с нуля',
        titleEn: 'Mimagau IF',
        divergencePoint: '<b>Арка 1.</b> Самое начало истории.',
        shortDesc: 'Это серия официальных первоапрельских историй, в которых пол всех персонажей изменён на противоположный. Нацуки Субару здесь — японская школьница, Эмилия (Эмилио) — красивый полуэльф-парень, а Рем и Рам — братья. Сюжет начинается в переулке, как в каноне, но из-за смены полов динамика отношений, диалоги и реакции героев сильно меняются.',
        link: 'https://docs.google.com/document/d/1KYAzU2bz5g3euEZCg5vKSrgGI1nF7F20/edit',
        poster: 'https://preview.redd.it/novels-subaru-and-emilio-mimagau-if-v0-or6of19lmyt81.jpg?auto=webp&s=4472916ba8eb960f80b574678a3c8a6b76302241',
        banner: 'https://embed.pixiv.net/artwork.php?illust_id=125613092&mdate=1735319598',
        summary: `Нацуки Субару теперь — обычная старшеклассница, которая попадает в иной мир и тут же подвергается нападению уличных хулиганок. От жестокой расправы её спасает прекрасный юноша <b>Эмилио</b> (мужская версия Эмилии) и его дух-котёнок <b>Тинк</b> (Пак). Субару мгновенно влюбляется в своего спасителя, называя его «Эмилио-кун», и решает помочь ему вернуть украденную инсигнию.
<img src="https://pbs.twimg.com/media/GR7z13MXQAAi0b2.jpg" alt="Эмилио и Субару 1">
В погоне за вором <b>Форте</b> (Фельт) Субару попадает на склад краденого, где сталкивается с ужасающим убийцей — <b>Энсом</b> (мужская версия Эльзы). Пережив несколько кровавых смертей и откатов, Субару удаётся привести на помощь <b>Адельхайд</b> — прекрасную девушку-Святого Меча (версия Райнхарда), которая прогоняет Потрошителя. Заслужив доверие Эмилио, влюблённая Субару устраивается работать горничной в особняк эксцентричной леди <b>Розваль</b>.

В особняке её встречают новые гендерно-инвертированные обитатели: высокомерный мальчик-дух <b>Виктор</b> (Беатрис) и братья-дворецкие <b>Рау и Реу</b> (Рам и Рем). Несмотря на комичные попытки Субару ухаживать за Эмилио, вскоре начинается настоящий кошмар. Субару умирает от проклятия демонозверей, а в одном из циклов её жестоко убивает Реу, заподозривший в ней шпионку из-за запаха Ведьмы. Когда же в другой петле от проклятия погибает сам Реу, Субару, не желая мириться с потерей друзей, отчаянно <b>прыгает со скалы</b>, чтобы спасти всех.
<img src="https://scontent.fiev7-4.fna.fbcdn.net/v/t39.30808-6/481662480_662746399756537_2944212907562815789_n.jpg?_nc_cat=100&ccb=1-7&_nc_sid=e06c5d&_nc_ohc=zSBgaGhPzAMQ7kNvwG0siZD&_nc_oc=AdqY_Qoid11ZwXxwBAWw4IP5IiulZEpsMLxpJiBFMkBg36JQnTEjKapED2GFBZeCaE8&_nc_zt=23&_nc_ht=scontent.fiev7-4.fna&_nc_gid=mYTKKg7NEkNaJUzPMAA15w&_nc_ss=7b2a8&oh=00_Af0QLD4pvxyizBn5oZINyKXxPiezgdYrgVeNWGETBrKJcQ&oe=69F53857" alt="Cубару, Рау и Реу">
В финальном цикле Реу тайно уходит в лес, чтобы в одиночку истребить стаю ульгармов. Он считает себя ничтожеством на фоне своего гениального брата Рау и готов отдать жизнь ради защиты особняка. Субару и Рау отправляются за ним и спасают израненного Реу от неминуемой гибели, а вернувшаяся леди Розваль сжигает остатки монстров. 

Очнувшись в кровати, Реу плачет от чувства вины, но Субару берёт его за руку и просит перестать корить себя. <i>«Давай улыбнёмся и поговорим о завтрашнем дне!»</i> — с тёплой улыбкой предлагает она, помогая дворецкому справиться с его комплексами. История заканчивается светлым моментом: Субару выживает на пятое утро, а Эмилио, краснея, соглашается пойти с ней на долгожданное свидание.
<img src="https://scontent.fiev7-4.fna.fbcdn.net/v/t39.30808-6/482220535_662746173089893_7213569557925840613_n.jpg?_nc_cat=109&ccb=1-7&_nc_sid=e06c5d&_nc_ohc=ZdSt3M9RNqcQ7kNvwFbbGVA&_nc_oc=Adrch35SaDji9Jaf1P-oo75rqsZz06rMkMi2qAuND3uT3vZ_K3yOhGV59Jf8ZfHNmgw&_nc_zt=23&_nc_ht=scontent.fiev7-4.fna&_nc_gid=vd9oZ0q_ZCx6h0Vn7HTm5A&_nc_ss=7b2a8&oh=00_Af22NVo0T2qcVeTweQdwZlk87qTWYx0YI0O0iy5lBCK3AQ&oe=69F54F55" alt="Эмилио и Субару 2">`,
        opinion: 'История никак не отличается от оригинал, только герои другого пола. Ставлю 5/10 только за то, что в интеренете тем много прикольных артов.'
    },
    {
        id: 'pride',
        titleRu: 'Гордость',
        fullTitleRu: 'Ошибочная жизнь в альтернативном мире с нуля',
        titleEn: 'Pride IF - Ayamatsu',
        divergencePoint: '<b>Арка 1.</b> В самом начале истории, когда Субару оказывается в переулке с бандитами. Вместо того чтобы позвать на помощь, он решает справиться сам.',
        shortDesc: 'Мрачная альтернативная история, где Субару Нацуки, ослеплённый гордыней и любовью к Эмилии, решает уничтожить всех врагов, чтобы сделать её королевой. Он совершает тысячи самоубийств, чтобы получить идеальную «точку сохранения», становится Архиепископом Гордыни, сжигает Лугунику и погибает от руки Рейнхарда.',
        link: 'https://ranobelib.me/ru/book/239839--reif-zero-kara-ayamatsu-isekai-seikatsu',
        poster: 'https://cover.imglib.info/uploads/cover/reif-zero-kara-ayamatsu-isekai-seikatsu/cover/dfa36ae6-e36d-4468-9c48-f5dca2c0c0bd_orig.jpg',
        banner: 'https://cover.imglib.info/uploads/cover/reif-zero-kara-ayamatsu-isekai-seikatsu/background/e8f77cb2-77b7-41cc-bce9-3b213aa51587.jpg',
        summary: `Нацуки Субару проживает свою <b>восемьдесят восьмую</b> попытку спасти ту, чья улыбка стала его единственным маяком в океане страданий. Начало истории «Гордости» пропитано запахом гари и вкусом собственной крови. Очнувшись в знакомой столице, Субару хладнокровно расправляется с грабителями в переулке и даёт себе клятву спасти сереброволосую девушку любой ценой.
<img src="https://ranobelib.me/uploads/ranobe/239839/chapters/3654058/e511409a-5aaa-4fe4-9e55-72076c1c7f21.jpg" alt="Субару в переулке">
Поняв, что убийцу Эльзу Гранхирт не одолеть в прямом бою, Субару хитростью стравливает её с <b>Райнхардом ван Астреей</b>. Идеальный рыцарь побеждает одним разрушительным ударом. Субару спасает умирающую Эльзу, делая её своей должницей и верной союзницей. Эмилия спасена от первой угрозы.
<img src="https://ranobelib.me/uploads/ranobe/239839/chapters/3654808/1ce3f5c2-1b08-4cd5-88ad-efc0b60c67b2.png" alt="Субару спасает Эльзу">
Спустя два месяца Субару узнаёт настоящее имя своей возлюбленной — <b>Эмилия</b>. Чтобы сделать её правительницей, он решает уничтожить Культ Ведьмы. Потратив сотни жизней, он разгадывает все секреты <b>Петельгейзе Романе-Конти</b> (Архиепископа Лени), жестоко предаёт его и убивает. Заслуги за победу над Ленью он передаёт Эмилии.
<img src="https://ranobelib.me/uploads/ranobe/239839/chapters/3969556/e4a24c3d-8b37-4f66-8309-bdef72941761.jpg" alt="Субару убивает Петельгейзе">
Затем Субару плетёт интриги из тени, методично устраняя другие лагеря Отбора. Он позволяет Белому Киту стереть из реальности фаворитку гонки — <b>Круш Карстен</b>. Мир забывает о её существовании, из-за чего её верный рыцарь <b>Феликс</b> окончательно сходит с ума. Субару запирает сломанного целителя в темнице и превращает в свою покорную марионетку.
<img src="https://ranobelib.me/uploads/ranobe/239839/chapters/3972547/0bdce67e-87eb-41b3-8e48-e00cfa499af9.jpg" alt="Субару пленил Феликса">
Понимая, что к другой кандидатке, <b>Анастасии Хошин</b>, не подобраться, Субару наносит сокрушительный удар по её лагерю. Он заставляет Феликса использовать слепое доверие и отравить своего лучшего друга — <b>Юлиуса Юклиуса</b>. 
<img src="https://ranobelib.me/uploads/ranobe/239839/chapters/3981605/942975d0-52fd-461c-a1c8-50cb520026cb.jpg" alt="Субару против Юлиуса 1">
<i>«Доверие — это сладкий яд, господин "Лучший"»</i>, — холодно произносит Субару, глядя на агонию рыцаря.
<img src="https://ranobelib.me/uploads/ranobe/239839/chapters/3972547/0bdce67e-87eb-41b3-8e48-e00cfa499af9.jpg" alt="Субару против Юлиуса 2">
Расправившись с остальными препятствиями, включая Архиепископа Жадности Регулуса, Субару переходит к финальному акту. Он сжигает Лугунику дотла, чтобы разрушить идеальный образ Райнхарда и сделать Эмилию единственной спасительницей. Ради этого Эльза и Мейли отдают свои жизни. Субару предстаёт перед Эмилией в своём старом спортивном костюме и объявляет себя <b>Архиепископом Гордости</b>. Он с безумной улыбкой принимает смерть от её рук, шепча: <i>«Я... люблю тебя»</i>, и, умирая в абсолютном блаженстве, слышит во тьме ласковый голос Сателлы.

<i>К последнему абзацу многовато картинок, так что посмотрите их тут - https://ranobelib.me/ru/239839--reif-zero-kara-ayamatsu-isekai-seikatsu/read/v1/c6?ui=4427630</i>
`,
        opinion: 'Не плохая ифка, но и не прям вау. Было интересно посмотреть на взаимодействия между Эльзой, Мейли и Субару. Поставлю 7/10. Кстати, по ней есть фан анимация - https://www.youtube.com/watch?v=9zQfbMG0ecU'
    },
    {
        id: 'wrath',
        titleRu: 'Гнев',
        fullTitleRu: 'Утопая в альтернативном мире с нуля',
        titleEn: 'Wrath IF - Oboreru',
        divergencePoint: '<b>Арка 2.</b> Во время 4-й петли в особняке Розвааля. Прыгнув со скалы, Субару решает не брать Рам за руку.',
        shortDesc: 'Альтернативная история Re:Zero, где Субару не смог преодолеть свою ненависть и отчаяние после травмирующих событий. Он превращается в жестокого параноика, который полагается только на Райнхарда, жертвуя всеми ради защиты Эмилии, становясь «чистильщиком» и теряя собственную личность.',
        link: 'https://ranobelib.me/ru/book/223714--rezero-kara-oboreru-isekai-seikatsu-wn?section=info&ui=4427630',
        poster: 'https://cover.imglib.info/uploads/cover/rezero-kara-oboreru-isekai-seikatsu-wn/cover/8c4c32da-bad7-429d-bfa5-635b11c7de89_orig.jpg',
        banner: 'https://cover.imglib.info/uploads/cover/rezero-kara-oboreru-isekai-seikatsu-wn/background/171e52bf-851b-4049-8744-a3f6e5518530.jpg',
        summary: `В этой истории Нацуки Субару ломается не от боли, а от <b>паранойи</b>. События берут начало во второй арке: после смерти Рем подозрения обитателей особняка падают на него. Не в силах доказать свою невиновность, Субару сбегает в заснеженный лес, где его настигает разъярённая Рам.
<img src="https://ranobelib.me/uploads/ranobe/223714/chapters/4104531/9bd90918-e6b2-4467-b6d3-a5f6af5511a4.png" alt="Рам на грани жизни и смерти">
Обезумевшая от горя сестра-близнец едва не задушила его прямо в снегу. <i>«Я... обязательно убью тебя»</i>, — её голос был полон чистейшей ненависти. На грани обморока Субару нащупывает тяжёлый камень и наносит ответный удар.
<img src="https://ranobelib.me/uploads/ranobe/223714/chapters/4104531/41586bfa-c2fa-4160-a018-f5e79b39a120.jpg" alt="Субару бьёт Рам камнем">
С этого момента его мир навсегда теряет краски. Субару начинает видеть всё в <b>чёрно-белых тонах</b>. Для него каждый встречный — потенциальный лжец и предатель. Единственные люди, сохранившие для него цвет, — это те, кто <b>искренен</b> в своих чувствах, даже если это чувство — жгучая ненависть.

Проходит два года. Субару основывает преступную организацию <b>«Плеяды»</b> и становится «Королём Чистки». Он подчиняет себе судьбы людей, используя их слабости и подбрасывая монету: если выпадает «решка», человека казнят. Его охраняют сильнейшие: шиноби <b>Халибел</b> и «Синяя Молния» <b>Сесилус Сегмунт</b>. Бывший особняк Розваля приходит в упадок.
<img src="https://ranobelib.me/uploads/ranobe/223714/chapters/4107347/2e723c52-0155-4306-b819-ac94a5ebdb87.png" alt="Розваль">
<b>Розваль Л. Мейзерс</b>, потеряв своих они-горничных, впадает в апатию и лишается рассудка. Его некогда величественный вид сменяется жалкостью. Субару отправляет Сесилуса, чтобы тот поставил точку в истории маркграфа.
<img src="https://ranobelib.me/uploads/ranobe/223714/chapters/4107347/16ee0aaf-500e-4c03-af49-98ea6c8dd1fe.png" alt="Сесилус убивает Розваля">
Одним молниеносным ударом Сесилус отсекает Розвалю руку, а затем и голову. <i>«Так это был ты, в конце концов»</i>, — успевает прошептать маг перед смертью. В это же время Субару обманом заставляет <b>Беатрис</b> поверить, что он — «Тот самый человек», и просит Халибела убить её, избавляя от мук долгого ожидания. 
<img src="https://ranobelib.me/uploads/ranobe/223714/chapters/4113260/b6d20f72-5df8-4221-a3cb-dab1f59addb6.png" alt="Беатрис">
<img src="https://ranobelib.me/uploads/ranobe/223714/chapters/4113260/81299ffe-b70c-4238-8ae4-fd50d9f952ac.jpg" alt="Субару убивает Беатрис">
Эмилию он держит в «птичьей клетке» — абсолютно белой комнате, где она медленно сходит с ума от зависимости. Но когда в замок врывается Райнхард, Эмилия умоляет раненого Субару бежать вместе. В этот миг она тоже теряет свои краски в его глазах — ведь её любовь кажется ему очередной ложью.

В финале Субару сбегает в потайную комнату, где на цепях томится <b>Рам</b>. Она — единственная, кто осталась цветной в его глазах, потому что её жажда мести за два года не угасла ни на йоту. Он подставляет ей своё горло, обретая покой в руках той, кто ненавидит его больше всех на свете.`,
        opinion: 'Конец истории остаётся открытым: автор не описывает саму смерть. Но очевидно одно — полностью сломленный Субару, потерявший всё и уставший от бесконечной паранойи, отдаёт свою жизнь в руки Рам. Он находит своё последнее, безумное утешение в её неизменной злобе, позволяя ей убить себя. Начался ли после этого новый цикл или он умер окончательно — остаётся загадкой, которую каждый читатель трактует по-своему. Очень даже интересная ифка. До этого момента я даже не думал, что Субару может оттолкнуть Эмилию. Также прикольно видеть персонажей из 7-ой и 8-ой арки. По моему они будут ещё в альт истории с Рем. Ставлю ифке 8/10.'
    },
    {
        id: 'dok',
        titleRu: 'Смерть или Поцелуй',
        fullTitleRu: 'Смерть или Поцелуй',
        titleEn: 'Death or Kiss',
        divergencePoint: 'Перед событиями <b>3-й арки</b>.',
        shortDesc: 'Re:Zero -DEATH OR KISS- — визуальная новелла, разработанная компанией 5pb (Steins;Gate). Релиз игры состоялся 30 Марта 2017 года для платформ PS Vita и Playstation 4. Для игры был специально написан оригинальный сюжет.',
        link: 'docs.google.com/document/d/1KYAzU2bz5g3euEZCg5vKSrgGI1nF7F20/edit',
        poster: 'https://static.actugaming.net/media/2016/10/re-zero-starting-life-in-another-world-death-or-kiss-game-cover.jpg',
        banner: 'https://external-preview.redd.it/visual-novel-re-zero-starting-life-in-another-world-death-v0-wb_75D7jDKk6n6LtI7j_wm2-lKFN5hdjY2Tb0lhne_E.jpg?auto=webp&s=db4b844e01f21b28c4aac7f0cbb8a87b75d601df',
        summary: 'События игры начинаются в Королевстве Лугуника, где проходит конкурс, известный как Всеобщие Выборы Прекрасной Королевы, в котором соревнуются пять кандидаток. Конкурс проводится по нескольким категориям, таким как: витиеватость и элегантность. Победитель получает известность во всём королевстве и некую Метию — магический предмет, приносящий удачу. Однако, когда Субару помогал с организацией конкурса, то случайно поцеловал этот предмет, в результате чего эта вещь сообщила ему: «Отдай мне свою кровь… в обмен на это ты получишь божественную защиту, позволяющую целовать противоположный пол. Однако если ты расскажешь кому-либо об этом проклятии, то будешь страдать от невыносимого несчастья». Из-за несчастья, вызванного проклятием, Субару вынужден использовать свою способность «Посмертное возвращение». В дальнейшем он обращается за помощью к Беатрис и узнает, что ему нужен поцелуй, чтобы избавиться от проклятия. В итоге Субару начинает развивать отношения с Эмилией и другими персонажами, а также вмешивается в конкурс, дабы убедиться, что никто не получит эту проклятую вещь.',
        opinion: 'Я не играл в эту игру, так что хз даже что и сказать. Смотрите пересказы сюжета на англ ютубе.'
    },
    {
        id: 'pott',
        titleRu: 'Пророчество о Троне',
        fullTitleRu: 'Пророчество о Троне',
        titleEn: 'The Prophecy of the Throne',
        divergencePoint: 'Начало <b>3-й арки</b> (Королевские выборы).',
        shortDesc: 'Re:Zero: The Prophecy of the Throne — игра, разработанная компанией Chime Corporation. Релиз состоялся 28 января 2021 на PS4, PC (Steam) и Nintendo Switch. Для игры был написан оригинальный сюжет под контролем автора ранобэ — Таппэя Нагацуки. Также в игре были представлены совершенно новые персонажи, за дизайн которых отвечал иллюстратор ранобэ — Синъитиро Оцука.',
        link: 'https://store.steampowered.com/app/1277510/ReZERO_Starting_Life_in_Another_World_The_Prophecy_of_the_Throne/?l=russian',
        poster: 'https://upload.wikimedia.org/wikipedia/en/a/a2/Re-Zero_%E2%88%92_Starting_Life_in_Another_World-_The_Prophecy_of_the_Throne_cover_art.jpeg',
        banner: 'https://assets.nintendo.com/image/upload/q_auto/f_auto/store/software/switch/70010000029072/0fac29aa9050a8d5d2fb8ab689b3c128c70a49d405bd99311c29324d4e956a25',
        summary: 'Спустя месяц после того, как Субару очутился в другом мире, в особняк Розвааля приезжает эмиссар, посланный из Королевского замка. Он сообщает, что королевские выборы откладываются без какой-то ведомой на это причины. Отсрочка данного грандиозного события, определяющего будущего правителя Лугуники, побуждает Субару и его друзей к действию. Они возвращаются в Королевскую столицу и обнаруживают, что объявился шестой кандидат на трон. Однако Драконий Камень предсказывал, что должны быть отобраны только пять кандидатов! Кто же самозванец? Подозрения тут же падают на Эмилию. Какие ответы лежат за таинственной паутиной убийств, предательств и заговоров...? ',
        opinion: 'Я в неё играл, так что вот моё ревью в стиме - (в процессе прохождения)'
    },
    {
        id: 'aganau',
        titleRu: 'Искупление',
        fullTitleRu: 'Искупление в альтернативном мире с нуля',
        titleEn: 'Aganau IF',
        divergencePoint: '<b>Арка 3.</b> Временная линия «15-го эпизода» аниме. Петельгейзе убивает Рем на глазах у Субару, но Субару отказывается использовать «Посмертное возвращение».',
        shortDesc: 'В этой альтернативной ветке из игры «Re:Zero — Lost in Memories», основанная на 3-й арке, Субару не возвращается в особняк Розвааля после смерти Рем, что приводит к трагическому итогу: он превращается в одержимого местью, сломленного человека, пытающегося искупить свои ошибки вместе с Феликсом, Эльзой и Мими.',
        link: 'https://ranobelib.me/ru/book/220880--orukosuryou-no-akayuki-zenpen?section=info&ui=4427630',
        poster: 'https://preview.redd.it/game-aganau-if-squad-v0-la9cltkt6yy91.jpg?auto=webp&s=b41376961e42a9bb6a975009b40e5873335deb52',
        banner: 'https://preview.redd.it/media-aganau-if-subaru-and-elsa-v0-86njm43csbk71.png?auto=webp&s=d3f779e058191c69f635d7d50e917427ec8119f3',
        summary: `В этой истории Субару после жестокой смерти Рем от рук Петельгейзе отказывается идти в особняк Розваля. Услышав её предсмертную просьбу <i>«Живи»</i>, он решает выжить, но посвящает свою жизнь единственной цели — изощрённой и безжалостной мести.

Проходит <b>двадцать лет</b>. Субару превращается в хладнокровного мстителя. Его левая рука заменена на тяжёлый стальной протез, переплавленный из моргенштерна Рем, а разум терзают постоянные галлюцинации погибшей возлюбленной. Заплатив <b>Старику Рому</b> за информацию, он узнаёт, что Петельгейзе скрывается в лесу Алам. Для победы Субару собирает команду: он жестоко шантажирует <b>Феррис</b>, потерявшего память из-за Белого Кита, поэтому он забыл Круш, нанимает <b>Эльзу</b> и случайно встречает бродячую наёмницу <b>Мими</b>. А также его всё это время сопровождала Патраш.
<img src="https://ranobelib.me/uploads/ranobe/220880/chapters/3419245/d416d922-2199-452a-b04a-227c64cec374.jpg" alt="Субару спустя 20 лет">
<img src="https://ranobelib.me/uploads/ranobe/220880/chapters/3419245/369d1321-3468-4d70-97eb-37dc7a8e8926.jpg" alt="Субару и голлюцинации">
Чтобы добыть оружие против духа, отряд отправляется в заброшенное поместье графа Риберка, кишащее маджирами. В сокровищнице они сталкиваются с бесплотным призраком — Пустотой Риберка. В бою им помогает <b>Беатрис</b> — она провела все эти двадцать лет в полном одиночестве в особняке Розваля, но всё же тайно последовала за Субару. С её помощью он распечатывает Священный Меч <b>«Убийцу Духов»</b> и сражает призрака. Ночью перед битвой Субару осознаёт свой эгоизм: он извиняется перед Беатрис за то, что обрёк её на одиночество, и обещает научить её чинить старую, потрёпанную куклу Пака.
<img src="https://ranobelib.me/uploads/ranobe/220880/chapters/3419890/1196fe0b-69f9-485d-9fd0-8ea0c047b2f7.jpg" alt="Субару и Беатрис">
В лесу Алам начинается решающая битва. Пока союзники отвлекают культистов, Субару остаётся один на один с Петельгейзе. Используя тьму Шамака и ослепляющий свет магического кристалла, он загоняет Архиепископа в ловушку внутри созданного Беатрис барьера и пронзает его живот «Убийцей Духов». Однако план даёт сбой: из-за стального протеза Субару не может наполнить меч маной, и оружие не уничтожает душу. Петельгейзе предсказуемо вселяется в тело Субару.
<img src="https://ranobelib.me/uploads/ranobe/220880/chapters/3419264/df3cafa3-54cf-4f31-9819-aaefb09f7e6c.jpg" alt="Петельгейзе против Субару">
Но именно этого Субару и ждал. Сдерживая безумного духа внутри собственного разума, он умоляет Беатрис (в альтернативной концовке / руте — Феррис) наполнить меч маной. <i>«Пожалуйста... не становись... такой, как я...»</i> — с этими словами Субару пронзает собственное горло, навсегда уничтожая Петельгейзе ценой своей жизни.
<img src="https://ranobelib.me/uploads/ranobe/220880/chapters/3419903/f2131bfe-bacc-4bb9-83f5-86785593a27f.jpg" alt="Субару обрывает свою жизнь">
Смерть не приносит долгожданного забвения. Субару открывает глаза и с ужасом понимает, что <b>«Посмертное Возвращение»</b> отбросило его на двадцать лет назад, к палатке с яблоками в столице. Увидев перед собой живую Рем, он падает на колени и захлёбывается слезами. Сбросив тяжёлый груз двадцатилетнего ада, Нацуки Субару клянётся больше никогда не сбегать и начинает свою историю спасения с абсолютного <b>нуля</b>.
<img src="https://ranobelib.me/uploads/ranobe/220880/chapters/3419900/9f85a584-bb77-4332-8390-614dac4cffe7.jpg" alt="Субару и Рем">`,
        opinion: 'Я в 2025 году видел фан арты по этой ифке и даже представить не мог, что это действительно отдельная альт история. Интересная ифка, которая посвящана Рем, и которая от части повторяет сюжет оригинальной истории. Я бы поставил 8 баллов, но из-за того, что всё возвращается к оригинальной сюжетной линии поставлю 7/10.'
    },
    {
        id: 'alcor',
        titleRu: 'Алькор',
        fullTitleRu: 'Фантом в альтернативном мире с нуля',
        titleEn: 'Alcor IF',
        divergencePoint: '<b>Арка 3.</b> Субару терпит окончательное поражение от Петельгейзе и Белого Кита, ломается и теряет свою личность.',
        shortDesc: 'Эксклюзивная история из мобильной игры Re:Zero - Lost in Memories. Субару сходит с ума от бесконечных смертей в 3-й арке, отказывается от своего имени и становится безжалостным антагонистом в маске по имени Алькор, который обладает способностью переписывать саму ткань времени.',
        link: 'https://youtu.be/cBOhmUaB-6Y?t=1785',
        poster: 'https://preview.redd.it/game-alcor-from-lost-in-memories-v0-1ix97l5mplfc1.png?auto=webp&s=b7d629cc3865a8470c90e988b0d57810dac15444',
        banner: 'https://preview.redd.it/spoiler-media-shion-and-lyra-v0-g7ydvnc5isqb1.jpg?width=640&crop=smart&auto=webp&s=cfcd4860001f75e18631b29e85841e00baa97ccb',
        summary: `Потерпев бесчисленное количество жестоких поражений, разум Субару окончательно разрушается. Он отказывается от своего человеческого прошлого и настоящего имени, надевает белую маску с черными перьями и берет псевдоним <b>«Алькор»</b> (в честь звезды из созвездия Большой Медведицы). Из эмоционального парня он превращается в холодного, безжалостного фантома, цель которого — любой ценой создать идеальную временную линию.
        
В отличие от каноничного Субару, Алькор получает от Сателлы усиленную, почти читерскую версию своей способности. Она называется <b>«Live Mindful of Death»</b> (Постмортемное изменение временной линии). Алькор способен не просто возвращаться после смерти, но и активно менять саму ткань времени в следующей петле так, как ему выгодно, по сути, переписывая события до своего возрождения.

У этой огромной силы есть побочный эффект. Изменения, которые Алькор вносит в реальность, вызывают неконтролируемый эффект бабочки. Кроме того, люди, имеющие с ним глубокую связь, начинают испытывать сильное дежавю, предвидя его следующие шаги в новых петлях.`,
        opinion: 'Так как это игра, ещё и мобильная, то я не смогу сделать свой личный пересказ. Но я попросил аишку хотябы немного расказать про что игра.'
    },
    {
        id: 'rem',
        titleRu: 'Лень',
        fullTitleRu: 'Если начать жизнь в альтернативном мире',
        titleEn: 'Sloth IF - Rem',
        divergencePoint: '<b>Арка 3.</b> Сцена из «18-го эпизода» аниме. Субару предлагает Рем всё бросить и сбежать в Карараги, и она соглашается.',
        shortDesc: 'В этой альтернативной истории рассказывается о том, как Субару и Рем вместе сбежали из Лугуники во время событий 3 арки, оставив всё позади, и начали совместную жизнь в стране Карараги. Печатный вариант этой истории можно было получить, купив одно из BD/DVD изданий аниме Re:Zero.',
        link: 'https://ranobelib.me/ru/book/49137--reif-kara-hajimeru-isekai-seikatsu?section=chapters&ui=4427630',
        poster: 'https://cover.imglib.info/uploads/cover/reif-kara-hajimeru-isekai-seikatsu/cover/ZyhfLdQXP5Ou_250x350.jpg',
        banner: 'https://cover.imglib.info/uploads/cover/reif-kara-hajimeru-isekai-seikatsu/background/8b7ec431-7e8c-41f3-8277-90a91cbf6c9c.jpg',
        summary: `Сломленный грузом бесконечных смертей в Столице и осознанием собственной бесполезности, Нацуки Субару сдаётся. Он умоляет Рем бросить всё и сбежать вместе с ним. Оставив Эмилию и остальных на верную гибель, они пересекают границу и прибывают в Карараги, остановившись в городе Банан. 

Первые месяцы даются невероятно тяжело. Субару страдает от языкового барьера (местного кансайского диалекта) и своей физической слабости, из-за чего не может найти работу. Рем берёт всё на себя: работает горничной, шьёт по ночам и содержит их обоих. Субару грызёт чувство вины, пока в их жизнь не вмешивается <b>Халибел</b> — сильнейший шиноби-волколак Карараги. Он проникается к ним симпатией, сдаёт первый этаж своего дома и помогает Субару устроиться разнорабочим. Жизнь наконец-то начинает налаживаться.

Тихую идиллию прерывает внезапная атака. Ночью на них нападает Великий Дух ветра <b>Зарестия</b>, известная как «Прекраснейшая Шинигами». Этот безумный и смертоносный дух пришёл, привлечённый густым, омерзительным запахом Ведьмы, который исходит от Субару. Начинается битва на выживание. Рем активирует форму Они, но быстро истощает свои силы. От неминуемой смерти их спасает Халибел, используя свои техники теневого клонирования, чтобы отвлечь разъярённого духа.
<img src="https://shikimori.one/system/characters/original/188131.jpg" alt="Зарестия">
После битвы Рем теряет сознание и долго не приходит в себя. Субару впадает в отчаяние, проклиная свою слабость. Однако вызванный лекарь ошарашивает его новостью: Рем не проклята и не ранена, она <b>беременна</b>. Осознание того, что он скоро станет отцом, прорывает плотину эмоций — Субару рыдает от абсолютного счастья. Он клянётся стать настоящим мужчиной и навсегда устранить угрозу Зарестии ради своей семьи.

Субару придумывает хитрый план. Изучив местную колыбельную, он узнаёт слабость Зарестии — из-за давней травмы она панически боится и мгновенно пьянеет от алкоголя. Устроив ловушку, они обливают могущественного духа крепким спиртным. Зарестия теряет силы и свою безумную сущность. Вместо того чтобы добить её, Субару и Рем проявляют милосердие. Одинокий дух обретает в их лице настоящую семью и становится для них своенравной, но любящей <b>«тётей Тией»</b>.
<img src="https://preview.redd.it/how-strong-would-rigel-be-v0-h63ztsbpua2e1.jpeg?width=640&crop=smart&auto=webp&s=1f2871358ff90664774285bd5c07bbd9613927b3" alt="Тётя Тией">
История переносится в будущее. Субару и Рем живут в счастливом браке. У них подрастает сын <b>Ригель</b> (унаследовавший острый язык Рам и глаза отца) и крохотная дочка <b>Спика</b>. Ригель комплексует из-за того, что он полудемон с рогом. Чтобы поддержать сына, Субару переделывает японский праздник Сэцубун. Разбрасывая бобы, он с широкой улыбкой кричит изменённую фразу: <i>«Они в дом! Счастье в дом!»</i>, доказывая сыну свою безграничную любовь.
<img src="https://ranobelib.me/uploads/ranobe/reif-kara-hajimeru-isekai-seikatsu/chapters/2177493/b06dc45ae9e83609c6ae743d82e55239_cyGD.png" alt="Рем и Ригель">
В глубине души Нацуки Субару понимает свой непростительный грех <b>Лени</b> — он знает, что его побег стоил жизни всем его друзьям в Лугунике. Но, глядя на улыбку Рем, ворчащего сына и спящую дочь, он осознаёт, что ни о чём не жалеет. Он променял путь героя на тихое, абсолютное счастье стать мужем и отцом.`,
        opinion: 'Эта просто офигенная история. Милая и добрая. Тут присутвует персонаж и 7-ой и 8-ой арки, что прикольно, и Зарестия, персонаж, которого не показывали в оригинальной истории. И она прикольная. Момент когда Субару даёт слово, что защитит Рем напомнил мне Рудиуса. Ставлю ифке 10/10.'
    },
    {
        id: 'lust',
        titleRu: 'Похоть',
        fullTitleRu: 'Жизнь с нуля в альтернативном мире. Сон бабочки',
        titleEn: 'Lust IF - Butterfly Dream',
        divergencePoint: '<b>Нет четкой привязки.</b> Условное расхождение после 3-й или 4-й арки.',
        shortDesc: 'Неканоничная альтернативная история. Она повествует о любовных отношениях Субару с несколькими героинями.',
        link: 'https://ranobelib.me/ru/book/51438--rezero-harem?ui=4427630',
        poster: 'https://cover.imglib.info/uploads/cover/rezero-harem/cover/E0nLHUl2Bq4C_250x350.jpg',
        banner: 'https://i.ytimg.com/vi/Ml9KW3zfY_k/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLB9N32GyoLmJrn9FGORVA9NUE19Ag',
        summary: `<b>«Сон бабочки» (Lust IF)</b>, стирает грань между реальностью и сладкой фантазией. В этой утопии Нацуки Субару достиг невозможного: он стал королём Лугуники и собрал невероятный гарем, покорив сердца всех кандидаток на трон и горничных.

День монарха расписан по минутам. Утро начинается в объятиях <b>Петры</b>, с которой он ласково флиртует прямо в постели. На завтрак его ждёт <b>Круш Карстен</b>. Она сильно комплексует из-за недостатка женственности, но Субару успокаивает её страстными поцелуями и с удовольствием ест приготовленную ею еду.
<img src="https://ranobelib.me/uploads/ranobe/rezero-harem/chapters/1011544/image_cG5v.png" alt="Круш">
Днём король тонет в государственных бумагах. Ему помогает <b>Рам</b>, которая за маской язвительных оскорблений прячет заботу и смущение. Внезапно в кабинет врывается <b>Присцилла</b>. Она спасает Субару от взрыва прототипа зажигалки, очередного его технологического изобретения, и в награду по-хозяйски садится ему на колени для жаркого поцелуя. 
<img src="https://ranobelib.me/uploads/ranobe/rezero-harem/chapters/1021535/image_qG6t.png" alt="Рам">
<img src="https://ranobelib.me/uploads/ranobe/rezero-harem/chapters/1052271/image_dISo.png" alt="Прис">
Позже его навещает <b>Анастасия Хошин</b>. Удобно устроившись на груди Субару, она признаётся, что он занимает почётное второе место в её сердце — сразу после денег. Вечером в спальне Субару находит <b>Фельт</b>. Она трогательно смущается из-за своих скромных форм на фоне остальных девушек, но обещает стараться быть для него самой лучшей наедине.
<img src="https://ranobelib.me/uploads/ranobe/rezero-harem/chapters/1076208/image_Kk8g.png" alt="Анастасия Хошин">
Особое семейное тепло Субару делит с <b>Рем</b>. Девушка <b>беременна</b> и дни напролёт вяжет милые вещицы для их будущего ребёнка. Субару с восторгом фантазирует о том, как будет баловать дочку или соревноваться с сыном.
<img src="https://ranobelib.me/uploads/ranobe/rezero-harem/chapters/1214956/image_NfBH.png" alt="Рем">
Заканчивается этот безумный, но счастливый день в объятиях главной возлюбленной — <b>Эмилии</b>. Не выдержав тяжести королевской ответственности, Субару проливает слёзы усталости. Эмилия нежно прижимает его к груди, утешая, как ребёнка. <i>«Я люблю тебя»</i>, — шепчет она в темноте спальни. Это история абсолютного, нереалистичного счастья, где сбылись все самые заветные мечты героя.
<img src="https://ranobelib.me/uploads/ranobe/rezero-harem/chapters/1340067/image_TwHR.png" alt="Эмилия">`,
        opinion: 'Ну в целом неплохо, ничего особенного. Просто взаимодействие гг с разными девушками. Ставлю 6/10.'
    },
    {
        id: 'greed',
        titleRu: 'Жадность',
        fullTitleRu: 'Повторение в альтернативном мире с нуля',
        titleEn: 'Greed IF - Kasaneru',
        divergencePoint: '<b>Арка 4.</b> Во время испытаний в Святилище. Субару принимает предложение Ехидны и заключает с ней контракт.',
        shortDesc: 'Была опубликована 1 апреля 2016 года. Таппэй Нагацуки написал главу под названием «Re: Zero kara Kasaneru Isekai Seikatsu» или более известную как «Kasaneru» и «Greed IF» (Жадность), в которой Субару подписал контракт Ехидны и решил использовать по полной свою способность Посмертного Возвращения, чтобы решить все свои проблемы и, в конце концов, сделать Эмилию королевой. История начинается после пятой сюжетной арки.',
        link: 'https://ranobelib.me/ru/book/48611--re-zero-kara-kasaneru-isekai-seikatsu?ui=4427630',
        poster: 'https://cover.imglib.info/uploads/cover/re-zero-kara-kasaneru-isekai-seikatsu/cover/h00rhnPKUBep_250x350.jpg',
        banner: 'https://cover.imglib.info/uploads/cover/re-zero-kara-kasaneru-isekai-seikatsu/background/xIyR1AWSxaZX',
        summary: `Субару принимает предложение Ведьмы Жадности <b>Ехидны</b> и заключает с ней контракт, полагаясь на её мудрость и свою способность «Посмертного Возвращения», чтобы создать идеальное будущее для Эмилии.

Спустя два года этот выбор превращает жизнь Субару в бесконечный, мучительный цикл. Он умирал <b>миллионы раз</b>. Его разум истощён, эмоции притупились, а отношение к собственной жизни полностью обесценилось. Для него смерть перестала быть трагедией — теперь это лишь кнопка «Сброс». Он убивает себя ради любой мелочи: чтобы узнать погоду для Петры, исправить неудачный разговор или просто проверить гипотезу. 

Субару носит на шее чёрный кристалл, позволяющий ему связываться с Ехидной. Она выступает его главным советником, нашёптывая ему планы и стратегии. Но её советы лишены эмпатии, и Субару всё больше отдаляется от человечности. 
<img src="https://ranobelib.me/uploads/ranobe/re-zero-kara-kasaneru-isekai-seikatsu/chapters/923926/lwmzqnznino_XyXb.jpg" alt="Субару">
Его окружение тоже необратимо сломано. Эмилия превратилась в безвольную марионетку. Поскольку Субару сам прошёл Испытания Святилища, оградив её от боли прошлого, она так и не смогла повзрослеть и преодолеть свои травмы. Теперь она полностью зависит от него, покорно спрашивая разрешения даже на то, чтобы просто учиться. Её психика настолько нестабильна, что, заметив царапины на шее Субару, она мгновенно теряет контроль над собой и замораживает коридоры особняка, пока он не успокоит её в своих объятиях. Чтобы хоть как-то отгородиться от прошлого, Эмилия коротко остригла свои прекрасные серебряные волосы.
<img src="https://ranobelib.me/uploads/ranobe/re-zero-kara-kasaneru-isekai-seikatsu/chapters/923933/8lvk5r2jdo4_SJUy.jpg" alt="Эмилия 1">
<img src="https://ranobelib.me/uploads/ranobe/re-zero-kara-kasaneru-isekai-seikatsu/chapters/923936/rym1d3f2mai_lEZF.jpg" alt="Эмилия 2">
Судьба Беатрис оказалась не менее трагичной. Субару силой вытащил её из горящего особняка, лишив Запретной Библиотеки и смысла жизни, так и не став для неё тем самым человеком, которого она ждала. Теперь она днями напролёт сидит в углу новой библиотеки, обхватив колени, и ненавидит Субару за то, что он не дал ей умереть. Когда он пытается обнять её, чтобы успокоить скорее себя, чем её, Беатрис в ярости впивается ногтями ему в шею до крови, но Субару лишь безропотно терпит эту боль.
<img src="https://ranobelib.me/uploads/ranobe/re-zero-kara-kasaneru-isekai-seikatsu/chapters/923930/7e9tksyrc6u_9oNV.jpg" alt="Беатрис 1">
<img src="https://ranobelib.me/uploads/ranobe/re-zero-kara-kasaneru-isekai-seikatsu/chapters/923931/vwpijgrbno8_nXnk.jpg" alt="Беатрис 2">
Гарфиэль сломлен собственным бессилием. Узнав, что Субару решил проблемы Святилища обманом и лишил его возможности защитить свой дом, юноша возненавидел его. В поисках утраченной гордости Гарфиэль каждое утро бросает вызов Райнхарду ван Астрее, но лишь для того, чтобы быть жестоко избитым и вдавленным в землю. Сам Святой Меча присоединился к лагерю Эмилии после того, как Субару своими манипуляциями заставил Фельт покинуть Королевские Выборы. Райнхард глубоко подавлен, считая себя недостойным рыцарем, от которого отвернулась его госпожа, и теперь покорно служит Субару, считая это своим долгом.

На фоне этого всеобщего отчаяния Розвааль — единственный, кто искренне доволен происходящим. Он восхищается тем, что Субару наконец-то стал действовать так, как было нужно магу: отбрасывая всё лишнее ради одной цели. И эта цель — сделать Эмилию королевой, чтобы получить Кровь Дракона и пробудить спящую Рем. Для грязной работы Субару нанял Эльзу Гранхирт. Охотница за кишками стала его личным киллером и палачом: когда Субару нужно отмотать время, он просто просит её отрубить ему голову, что она делает с пугающей лёгкостью. Тем временем Отто Сувен покинул лагерь, осознав, что Субару взвалил всё на себя и никогда не считал его настоящим другом. И только юная Петра, ставшая за эти два года прекрасной четырнадцатилетней горничной, продолжает дарить Субару тёплые улыбки по утрам, даже не подозревая, в какой ад превратилась его жизнь.
<img src="https://ranobelib.me/uploads/ranobe/re-zero-kara-kasaneru-isekai-seikatsu/chapters/923934/ohw8cf11f8g_1JY5.jpg" alt="Лагерь Эмилии">
Несмотря на чудовищные моральные потери, Субару уверен, что поступает правильно. Ведь физически все живы. Он добровольно стал жертвой ради «счастья» остальных, не понимая, что превратил их жизни в золотую клетку. А Ехидна, попивая чай в мире грёз, с восторгом и извращённым восхищением наблюдает, как её контрактор уничтожает собственную душу ради эфемерного идеала.`,
        opinion: 'У этой истории есть перезапуск - https://ranobelib.me/ru/book/208962--rezero-kara-kasaneru-isekai-seikatsu-ln?ui=4427630, который был выпущен ограниченным тиражом 19 октября 2021 года. По сюжету он ничем не отличается от того, что вышел в 2016 годоу. История этой ифки приколная, очень интересно наблюдать за тем как все ломаются. Не скажу что это самая лучшая ифка, но популярность она точно заслужила. Прикольно что Петра как в оригинальном сюжете, так и в альтернативном упоминается, подводя нас к тому, что с ней будет в 9-ой арке, это прикольно. Теперь я шарю за все арты, связанные с этой ифкой. Ставлю ей 8/10.'
    },
    {
        id: 'gluttony',
        titleRu: 'Чревоугодие',
        fullTitleRu: 'Жизнь с нуля в альтернативном мире. Разбитые воспоминания',
        titleEn: 'Gluttony IF - Tsugihagu',
        divergencePoint: '<b>Арка 6.</b> В Сторожевой Башне Плеяды, после того как Субару теряет свою память и поддается паранойе.',
        shortDesc: 'Неканоничная альтернативная история. Она начинается с событий шестой арки, после того, как Субару теряет свою память. На фоне происходящего он сходит с ума, после чего решает убить всех своих друзей, объединившись с Шаулой, чтобы впоследствии забрать их «Книги мертвых» и восстановить свои воспоминания.',
        link: 'https://ranobelib.me/ru/book/51439--re-zero-kara-tsugihagu-isekai-seikatsu?ui=4427630',
        poster: 'https://cover.imglib.info/uploads/cover/re-zero-kara-tsugihagu-isekai-seikatsu/cover/JDK7g4SNpu8L_250x350.jpg',
        banner: 'https://embed.pixiv.net/artwork.php?illust_id=117844397&mdate=1713101796',
        summary: `Потеряв память в Сторожевой Башне Плеяды, Субару с ужасом осознаёт, что прошлый «Нацуки Субару» был для всех великим героем. Не в силах соответствовать этому идеалу, он решает <b>«склеить»</b> личность прежнего себя по кусочкам. План безумен: чтобы прочесть <b>Книги Мёртвых</b> всех своих друзей и забрать их воспоминания, он должен убить их собственными руками.

Его главным орудием и единственной союзницей становится <b>Шаула</b>, которая искренне любит нынешнего, «пустого» Субару. Субару действует предельно расчётливо и хладнокровно. Случайно встретив Регина (брата Отто), он без колебаний приказывает Шауле отсечь ему голову, чтобы просто прочесть его книгу.
<img src="https://ranobelib.me/uploads/ranobe/re-zero-kara-tsugihagu-isekai-seikatsu/chapters/1314894/image_CbIe.png" alt="Шаула - единственная союзница Субару"></img>
Заполучив часть воспоминаний лагеря Эмилии, Субару анализирует их (советуясь с голосами мёртвых в своей голове) и приходит к выводу, что самый опасный и проницательный враг — <b>Отто Сувен</b>. Ради его гарантированного убийства Субару разрабатывает чудовищный план: он открывает шлюзы Пристеллы и <b>затапливает весь Город Водных Врат</b>.
<img src="https://ranobelib.me/uploads/ranobe/re-zero-kara-tsugihagu-isekai-seikatsu/chapters/1404751/image_htq2.png" alt="Субару затопил город"></img>
Вода отрезает Отто от земли и животных, полностью лишая его Божественной Защиты и путей к отступлению. В этом водном аду Шаула расстреливает выживших лучами света, вспарывает живот бросившемуся в атаку <b>Гарфиэлю</b>, а затем раздавливает голову загнанному в угол Отто. <i>«Я убиваю вас, продумывая всё до мельчайшей детали. Я не стал недооценивать никого, кроме себя»</i>, — признаётся Субару.
<img src="https://ranobelib.me/uploads/ranobe/re-zero-kara-tsugihagu-isekai-seikatsu/chapters/1404751/image_r2OL.png" alt="Субару и Отто"></img>
Когда в затопленный город прибывает <b>Райнхард</b>, Субару понимает, что в прямом столкновении Святого Меча не убить. Он использует грязную уловку: приказывает Шауле атаковать убежище на краю города, где прячется Фельт. Пока Райнхард бросается спасать свою госпожу, Субару сбегает. Он клянётся, что однажды найдёт слабое место и убьёт Райнхарда, чтобы забрать и его книгу.

Оставшись наедине с Шаулой, Субару даёт ей жуткое обещание: когда он соберёт все фрагменты и убьёт Райнхарда, она станет его <b>последней жертвой</b>. <i>«Можешь использовать меня, как захочешь, пока я не приду к жалкому концу»</i>, — счастливо смеётся Шаула. Окружённый галлюцинациями своих мёртвых друзей, Субару продолжает свой путь, бесконечно убивая и «склеивая» чужие воспоминания, превращаясь в монстра.
<img src="https://ranobelib.me/uploads/ranobe/re-zero-kara-tsugihagu-isekai-seikatsu/chapters/1433063/image_7M5F.png" alt="Субару и Шаула"></img>`,
        opinion: 'Моя 1-ая и самая любимая ифка, т.к. в ней фигурирует Шаула, мой любимый персонаж. История крутая и жестокая. Только при 2-ом прочтении я заметил, что Субару поступил также ка и архиепископы в 5-ой арке, они тоже хотели затопить город, то им помешали. А в этой ифке Субару осуществляет этот план. Ставлю 10/10.'
    },
    {
        id: 'azamuku',
        titleRu: 'Ложь',
        fullTitleRu: 'Ложь в альтернативном мире с нуля',
        titleEn: 'Azamuku IF',
        divergencePoint: '<b>Арка 7.</b> Вместо Гинунхайва Сателла кидает Субару прямо в Рапгану, где он встречает Чишу Голда.',
        shortDesc: 'Основной момент разветвления с основной историей — начало седьмой арки, телепортация Субару в Волакию. Вместо Гинунхайва Сателла кидает его прямо в Рапгану, где Винсент берёт Субару, Рем и Луи под стражу. Это была настоящая встреча Нацуки Субару и «Белого Паука» Чиши Голда. Это была настоящая встреча двух людей, чьи судьбы никогда не должны были пересечься, двух людей, которые смогли обмануть судьбу.',
        link: 'https://ranobelib.me/ru/book/233216--reif-azamuku?section=chapters&ui=4427630',
        poster: 'https://cover.imglib.info/uploads/cover/reif-azamuku/cover/e27fc830-306d-4293-8af9-9ef2331292ff_orig.jpg',
        banner: 'https://cover.imglib.info/uploads/cover/reif-azamuku/background/b2d86d62-3224-41d7-9943-2a12c997484a.jpg',
        summary: `Субару попадает в Империю Волакию, где его раз за разом жестоко убивают. Спасаясь, он случайно натыкается на Императора <b>Винсента Волакию</b> и называет своё настоящее имя. Так он оказывается втянут в тяжёлую гражданскую войну.

Субару вынужден переодеваться в девушку — <b>Нацуми Шварц</b>, чтобы отыгрывать роль невесты правителя. В городе Хаосфрейм, защищая его от смертельного удара, Субару получает жуткую рану. И тут раскрывается главная ложь: всё это время под маской Императора скрывался <b>Чиша Голд</b> — Белый Паук, узурпировавший трон с помощью способности «Театр Но», позволяющей красть чужие облики и даже силы (именно так он исцеляет Субару личиной Феликса).

Чиша признаётся, что сверг Винсента лишь для того, чтобы спасти Империю от грядущего <b>Великого Бедствия</b>. Субару и Чиша заключают тайный союз двух величайших лжецов. Вместе они отправляются на Гладиаторский Остров за «Синей Молнией» <b>Сесилусом Сегмунтом</b>. Когда Чиша случайно злит Ведьму Зависти, попытавшись надеть «маску» Субару, два Сесилуса (Чиша во взрослом облике и оригинальный ребёнок) дают её колоссальной тени легендарный бой.

Накануне решающей битвы за столицу Чиша усыпляет Субару и тайно отправляет его вместе с Рем и Луис к границе Королевства, решая пожертвовать собой. Очнувшись, Субару с помощью телепортации Луис и летучего дракона мчится обратно. Но он не успевает: Чиша хитростью подменяет настоящего Винсента и принимает на себя смертельный луч света. <i>«Это мой лучший и единственный шанс закрыть занавес на этой великой сцене»</i>, — величайший лжец умирает на глазах у своего господина, успешно одурачив саму судьбу.

В финале столицу накрывает армия ходячих мертвецов. Проливая слёзы, Субару встаёт плечом к плечу с настоящим Императором Винсентом, чтобы исполнить последнюю волю Чиши: <i>«Я принимаю эстафету, переданную мне без моего ведома! Госпожа Судьба, я готов!»</i>`,
        opinion: 'История описывает сюжет 7-ой арки, но чуть-чуть изменяя его. Нам больше показывают Чишу, ну и всё. 6/10.'
    },
    {
        id: 'sasageru',
        titleRu: 'Посвящение',
        fullTitleRu: 'Посвятить жизнь в альтернативном мире с нуля',
        titleEn: 'Sasageru IF',
        divergencePoint: '<b>Арка 9.</b> Расхождение происходит во время событий девятой арки ранобэ.',
        shortDesc: 'Поражение в битве с Альдебараном стало для Нацуки Субару и Беатрис роковым. Проснувшиеся четыре столетия спустя, они сталкиваются с невыносимой реальностью: прежний мир обратился в прах, Империя Волакия правит миром, а близкие люди давно канули в вечность. Пока загадочный Безумный Принц начинает свою охоту, Субару и Беатрис вынуждены искать путь в этой чуждой, враждебной яви. Это история о посвящении себя единственной цели — вернуть ту, ради которой он жил.',
        link: 'https://ranobelib.me/ru/book/261489--zero-kara-sasageru-isekai-seikatsu?section=chapters&ui=4427630',
        poster: 'https://cover.imglib.info/uploads/cover/zero-kara-sasageru-isekai-seikatsu/cover/9000ca4e-42ac-4e31-93ff-7c18204caf7d_orig.jpg',
        banner: 'https://cover.imglib.info/uploads/cover/zero-kara-sasageru-isekai-seikatsu/background/09aff5aa-a297-4844-8d45-70835465bf58.jpg',
        summary: `История начинается с того, как Нацуки Субару приходит в себя после чудовищно долгого сна. Он обнаруживает, что его тело полностью парализовано из-за разрыва связи между душой и плотью. Рядом с ним находится его верный дух Беатрис, которая не пострадала от этого эффекта, так как её душа и мана-тело едины. Вскоре юноша узнаёт сокрушительную правду от Николы Сувена, молодого торговца и потомка Отто: со дня, когда Альдебаран запер Субару и Беатрис в сфере абсолютной тьмы, прошло целых четыреста лет. Оказалось, что Отто оставил своим потомкам строгий наказ вызволить их со дна Великого Гейзера Моголейд во что бы то ни стало. Семье Сувен помогала Румела Иа Юклиус — в прошлом один из квази-духов Юлиуса, а теперь Великий Дух Огня, принявшая облик высокой и пышной женщины.

'Субару с ужасом осознаёт, что мир, который он знал, безвозвратно изменился, а большинство его друзей давно мертвы. Королевства Лугуника и Карараги пали, и теперь огромными территориями правит Единая Империя Волакия во главе с юной Розалиндой — потомком Авеля и Медиум. Единственной из его близких, кто смог пережить эти века, оказалась Эмилия. Чтобы сохранить жизнь Альдебарану, который знал способ снять печать с Субару, она использовала свою магию и заморозила себя вместе с ним в Вечном Леднике Агзад. Однако добраться до неё невозможно: ледник стал логовом чудовищно могущественной Ведьмы Уныния, которая нападает на любого, кто осмелится подойти. Вдобавок ко всему, Субару узнаёт страшную цену своего спасения: пятеро сестёр-духов Румелы пожертвовали своими жизнями, отвлекая внимание врагов, чтобы дать Николе шанс вытащить их из гейзера. Под тяжестью этих смертей и осознания абсолютной потери Субару впадает в глубокое отчаяние и полностью забрасывает попытки вылечиться.

Мрачная рутина обрывается, когда на их убежище внезапно нападает <b>«Безумный Принц» Вэйг Адгард</b>. Это бессмертный человек-полудух из Густеко, который безумно ненавидит всех духов и стремится их истребить. Он обладает немыслимой силой, использует световые мечи и раз за разом убивает Субару, Беатрис и их защитников за считанные секунды. В бесконечной петле смертей Субару не может ничего противопоставить монстру, пока Никола не жертвует своей ногой, дистанционно провоцируя Ведьму Уныния, чтобы та пришла им на помощь. Ведьма появляется на поле боя вместе с гигантским Багровым Скорпионом и с легкостью побеждает Принца, используя своё Полномочие, чтобы растянуть для него мгновение боли в миллион раз. Когда Субару смотрит на Ведьму, он узнаёт в ней ту самую ■■■■■, но магия мироздания не позволяет ему даже произнести её имя вслух, стирая воспоминания о ней. Ради того, чтобы дожить до его пробуждения, эта девушка пожертвовала своими воспоминаниями, эмоциями и правом на нормальную жизнь, проведя четыреста лет в невыносимой пустоте.

Осознав, какую колоссальную жертву принесла ■■■■■, проведя четыре века в одиночестве ради него, Субару клянётся никогда её не забывать и отчаянно берёт себя в руки. Он решает посвятить свою жизнь её спасению. На кропотливое восстановление связи между разумом и телом у него уходит целых сорок лет. За это время юноша превращается в седого шестидесятилетнего старика, но его решимость остаётся непоколебимой. К его финальному походу присоединяются верная Беатрис, Никола (ставший мужем Румелы), сама Румела, императрица Розалинда и её Божественные Генералы Аракия и Мэделин. Также Мэделин удаётся отыскать Клинда — драконид четыреста лет провёл в пьянстве, терзаясь чувством вины за то, что когда-то передал ■■■■■ Фактор Уныния, но ради Субару он решает выйти на финальный бой в костюме дворецкого.

Команда прибывает к Вечному Леднику, где Вэйг Адгард, ставший ещё сильнее, вновь преграждает им путь. Пока Клинд, Аракия, Мэделин и Румела вступают в эпический и неравный бой с чудовищным Принцем, Субару наконец-то добирается до ■■■■■. Юноша разрушает стену её изоляции, крепко обнимая Ведьму, и обещает стать для неё всем тем, чего она была лишена столетиями. Растроганная девушка впервые за века улыбается и признаётся ему в любви, и Субару с теплотой принимает её чувства, хотя тут же в шутливой манере напоминает, что во льдах его всё ещё ждёт Эмилия. В финале истории шестидесятилетний Нацуки Субару сажает Беатрис себе на плечи и с громким боевым кличем бросается в гущу сражения. Он больше не оглядывается на потерянное прошлое, а бежит навстречу своему новому будущему, чтобы прожить его вместе со своими соратниками.</b>

В послесловии создатель истории, Таппэй Нагацуки, поясняет, что это альтернативная IF-ветка (маршрут поражения), которая отходит от событий девятой сюжетной арки. Он официально подтверждает, что Ведьма Уныния — это Петра, а Никола, рискнувший всем ради спасения героев, всё-таки добился брака с Великим Духом Румелой. Императрица Розалинда, к сожалению, умерла молодой от болезни еще до финальной битвы, но оставила после себя великое наследие. Субару же, несмотря на то что потерял почти всех близких из своего времени, смог переступить через отчаяние и стать настоящим героем этого изменившегося мира.`,
        opinion: 'Интересная ифка, я знал основной сюжетный поворот, что ведьма это Петра, т.к. читал 9-ую арку. Но я не мог подумать, что она станет фигурой, чьё имя внушает ещё больший страх, чем сама Сателла. Приятно видеть персонажей из других ифок и из оригинальной истории. Жалко что нет иллюстраций. Ставлю этой ифке 9/10, чего-то всё таки не хватило.'
    },
    {
        id: 'academy',
        titleRu: 'Тщеславие',
        fullTitleRu: 'Школьная жизнь с нуля не в альтернативном мире',
        titleEn: 'Vainglory IF - First Period',
        divergencePoint: '<b>Отсутствует.</b> Альтернативная современная вселенная без магии.',
        shortDesc: 'Одна из альтернативных историй Re:Zero/ Первая часть была опубликована 1 апреля 2015 года. Таппэй Нагацуки написал первую главу альтернативной истории под названием «Re: Zero kara Hajimeru Isekai de wa nai Gakuen Seikatsu» или более известную как «Re:Zero Academy» и «Vainglory IF» (Тщеславие), в которой все персонажи Re:Zero живут в современном мире, в одном городе. Все они ходят в одну и ту же школу — академию Лугуника. После первой части со временем были выпущены ещё три части истории.',
        link: 'https://ranobelib.me/ru/book/254284--rezero-kara-hajimeru-isekai-de-wa-nai-gakuen-seikatsu-wn?section=chapters&ui=4427630',
        poster: 'https://cover.imglib.info/uploads/cover/rezero-kara-hajimeru-isekai-de-wa-nai-gakuen-seikatsu-wn/cover/e7ccd0ff-939f-4242-90a8-5cbe6372642a_orig.jpg',
        banner: 'https://cover.imglib.info/uploads/cover/rezero-kara-hajimeru-isekai-de-wa-nai-gakuen-seikatsu-wn/background/e04e2cfa-4a39-49a7-b509-1a01fdc2a8ed.jpg',
        summary: `Утро Нацуки Субару начинается с того, что его будит очаровательная младшая сестрёнка <b>Беатрис</b>. За завтраком, состоящим исключительно из блюд с майонезом, он общается с родителями, а затем отправляется в школу в компании своей верной подруги детства <b>Рем</b>. По пути они встречают множество знакомых: стеснительную Минерву, безнадёжно влюблённого в Рам Гарфиэля и приставучую Дафну.
<img src="https://cover.imglib.info/uploads/cover/rezero-kara-hajimeru-isekai-de-wa-nai-gakuen-seikatsu-wn/cover/e7ccd0ff-939f-4242-90a8-5cbe6372642a_orig.jpg" alt="Рем, Беатрис и Субару">
У школьных ворот кипит жизнь: студсовет в лице <b>Круш</b> и <b>Ферриса</b>, который досматривает женские сумки, наводит порядок, а высокомерная Присцилла агрессивно спорит с Анастасией. На классном часе классная руководительница Фредерика представляет новую ученицу — <b>Эмилию</b>. Субару мгновенно влюбляется и, чтобы сесть поближе к ней, подбивает класс на хаотичную «Глобальную Смену Мест». По иронии судьбы он оказывается на первой парте между Рем и неудачливым Отто, а Эмилия попадает в центр класса, окружённая студсоветом.
<img src="https://ranobelib.me/uploads/ranobe/254284/chapters/3896185/80f4f63c-c21d-4afd-ab92-5788e1dde97e.png" alt="Эмилия">
После уроков Субару вызывается провести для Эмилии экскурсию. Он показывает ей гордость школы — тайный «Сад Демона» (огромную цветочную клумбу). Из-за недопонимания Эмилия решает, что Субару хочет с ней подраться, и на полном серьёзе принимает боевую стойку, но конфликт быстро перерастает в смех. 
<img src="https://ranobelib.me/uploads/ranobe/254284/chapters/3898375/2b6e96a1-e906-497e-b3fd-553ea44ffc78.png" alt="Эмилия против Субару">
Их идиллию прерывает директор школы <b>Вильгельм</b>, который три часа кряду мучает подростков бесконечными историями о любви к своей жене Терезии.
<img src="https://ranobelib.me/uploads/ranobe/254284/chapters/3898375/e767cd55-c883-4a76-a1de-aab2231db874.png" alt="Вильгельм">
По дороге домой Эмилия пытается назвать Субару по имени, но по ошибке называет его «Нацуки». Субару начинает называть её «Эмилия-тан», и их отношения стремительно теплеют. Однако на следующее утро мирная жизнь даёт трещину: у ворот дома Субару появляется <b>Шаула</b> — ещё одна переведённая ученица и, как она утверждает, его «подруга детства из-за границы». Она сразу же вступает в яростную борьбу с Рем за внимание своего любимого «Мастера». 
<img src="https://ranobelib.me/uploads/ranobe/254284/chapters/3898398/d5646d80-4772-4157-b6d2-d971b8d87526.png" alt="Шаула">
В классе Субару обменивается номерами телефонов с Эмилией, которая пользуется старомодным кнопочным мобильником, и планирует собрать всех друзей, включая вечно убегающую <b>Фельт</b> и влюблённого в неё <b>Райнхарда</b>, на грядущем Празднике цветения сакуры. Это невероятно тёплая и слащавая история, дарящая полюбившимся героям заслуженную беззаботную юность.`,
        opinion: 'Один из минусов этой ифки в том, что она выходила в разные года, и не факт что на данный момент закончилась. Но в целом неплохо. Лично меня тяжело впечатлить повседневность школьников, но приятно читать на разные отсылки из оригинальной истории: Эмилия использует старые слова и фразы, а также телефон, Шаула думает, что она подруга детства Субару и называет его мастером. В целом дборая и малая ифка, думаю 7/10 будет нормально.'
    },
];

const app = {
    init() {
        this.cacheDOM();
        this.bindEvents();
        this.initTheme();
        this.renderGrid();
    },

    cacheDOM() {
        this.themeToggle = document.getElementById('theme-toggle');
        this.homeView = document.getElementById('home-view');
        this.detailView = document.getElementById('detail-view');
        this.gridContainer = document.getElementById('if-grid');
    },

    bindEvents() {
        this.themeToggle.addEventListener('click', () => this.toggleTheme());
    },

    initTheme() {
        const savedTheme = localStorage.getItem('theme');
        if (savedTheme === 'light') {
            document.body.classList.remove('dark-theme');
            this.themeToggle.innerHTML = "<i class='bx bx-moon'></i> <span>Тёмная</span>";
        } else {
            document.body.classList.add('dark-theme');
            this.themeToggle.innerHTML = "<i class='bx bx-sun'></i> <span>Светлая</span>";
        }
    },

    toggleTheme() {
        const isDark = document.body.classList.contains('dark-theme');
        if (isDark) {
            document.body.classList.remove('dark-theme');
            localStorage.setItem('theme', 'light');
            this.themeToggle.innerHTML = "<i class='bx bx-moon'></i> <span>Тёмная</span>";
        } else {
            document.body.classList.add('dark-theme');
            localStorage.setItem('theme', 'dark');
            this.themeToggle.innerHTML = "<i class='bx bx-sun'></i> <span>Светлая</span>";
        }
    },

    renderGrid() {
        this.gridContainer.innerHTML = '';
        ifData.forEach(item => {
            const card = document.createElement('div');
            card.className = 'card';
            card.onclick = () => this.showDetail(item.id);

            card.innerHTML = `
                <div class="card-img-wrapper">
                    <img src="${item.poster}" alt="${item.titleRu}" loading="lazy">
                    <div class="card-overlay">
                        <p>${item.shortDesc}</p>
                    </div>
                </div>
                <div class="card-title">${item.titleRu}</div>
            `;
            this.gridContainer.appendChild(card);
        });
    },

    formatText(htmlString) {
        if (!htmlString) return 'Нет данных.';
        let text = htmlString.replace(/<br\s*[\/]?>/gi, '\n');
        text = text.replace(/<\/p>/gi, '\n\n');
        text = text.replace(/<img[^>]*>/gi, '');
        text = text.replace(/<[^>]*>?/gm, '');

        let txt = document.createElement("textarea");
        txt.innerHTML = text;
        return txt.value.trim();
    },

    generateStoryText(item) {
        const separator = '='.repeat(60);
        const subSeparator = '-'.repeat(40);
        return `
${separator}
НАЗВАНИЕ: ${item.titleRu} / ${item.fullTitleRu}
АНГЛ. НАЗВАНИЕ: ${item.titleEn}
${separator}

ТОЧКА РАСХОЖДЕНИЯ:
${this.formatText(item.divergencePoint)}

${subSeparator}
КРАТКОЕ ОПИСАНИЕ:
${this.formatText(item.shortDesc)}

${subSeparator}
ПЕРЕСКАЗ СЮЖЕТА:
${this.formatText(item.summary)}

${subSeparator}
МОЁ МНЕНИЕ:
${this.formatText(item.opinion)}

Читать историю: ${item.link}
`.trim();
    },

    downloadFile(filename, content) {
        const blob = new Blob([content], { type: 'text/plain;charset=utf-8' });
        const url = URL.createObjectURL(blob);
        const a = document.createElement('a');
        a.href = url;
        a.download = filename;
        document.body.appendChild(a);
        a.click();
        document.body.removeChild(a);
        URL.revokeObjectURL(url);
    },

    downloadSingle(id) {
        const item = ifData.find(i => i.id === id);
        if (!item) return;
        const text = this.generateStoryText(item);
        this.downloadFile(`ReZero_IF_${item.titleRu}.txt`, text);
    },

    downloadAll() {
        const header = `СБОРНИК ВСЕХ АЛЬТЕРНАТИВНЫХ ИСТОРИЙ (IF) RE:ZERO\n\n`;
        const allText = ifData.map(item => this.generateStoryText(item)).join('\n\n\n\n' + '※ '.repeat(30) + '\n\n\n\n');
        this.downloadFile('ReZero_All_IF_Stories.txt', header + allText);
    },

    showDetail(id) {
        const item = ifData.find(i => i.id === id);
        if (!item) return;

        document.getElementById('detail-banner').src = item.banner;
        document.getElementById('detail-title-ru').textContent = item.fullTitleRu;
        document.getElementById('detail-title-en').textContent = item.titleEn;
        document.getElementById('detail-divergence').innerHTML = item.divergencePoint;
        document.getElementById('detail-short').textContent = item.shortDesc;
        document.getElementById('detail-link').href = item.link;
        document.getElementById('detail-summary').innerHTML = item.summary;
        document.getElementById('detail-opinion').innerHTML = item.opinion;
        document.getElementById('detail-download-btn').onclick = () => this.downloadSingle(id);

        this.homeView.classList.remove('active');
        this.detailView.classList.add('active');
        window.scrollTo(0, 0);
    },

    goHome() {
        this.detailView.classList.remove('active');
        this.homeView.classList.add('active');
    }
};

document.addEventListener('DOMContentLoaded', () => app.init());